<template>
  <div class="services">
    <service
      class="services__service"
      header="Юридические услуги"
      no-button
    >
      <div class="services__content">
        <list :items="legal[0]" />
        <list :items="legal[1]" />
      </div>
    </service>

    <h2 class="services__title">
      Банкротство
    </h2>

    <service
      class="services__service"
      header="Недвижимость"
      header-tag="h2"
      no-button
    >
      <div class="services__content">
        <list :items="estate[0]" />
        <list :items="estate[1]" />
      </div>
    </service>

    <service
      class="services__service"
      header="Представительство в суде"
      header-tag="h2"
      no-button
    >
      <div class="services__content">
        <list :items="court[0]" />
        <list :items="court[1]" />
      </div>
    </service>

    <h2 class="services__title">
      Юридический аутсорсинг – абоненское обслуживание юридических лиц и индивидуальных предпринимателей
    </h2>

    <h2 class="services__title">
      Регистрация товарного знака
    </h2>

    <service
      class="services__service"
      header="Бухгалтерские услуги"
      header-tag="h2"
    >
      <div class="services__content">
        <list :items="accounting[0]" />
        <list :items="accounting[1]" />
      </div>
    </service>
  </div>
</template>

<script>
import Service from '../components/core/service/Service'
import List from '../components/core/list/List'
export default {
  name: 'Services',
  components: { List, Service },
  data () {
    return {
      legal: [
        [
          'Юридическая консультация',
          'Подготовка договора<br/>средней сложности (на базе<br/>стандартного имеющегося с внесение<br/>незначительных корректировок основных<br/>условий)',
          'Подготовка учредительных документов<br/>и государственная регистрация ООО',
          'Внесение изменений в сведения из ЕГРЮЛ<br/>о юридических лицах',
          'Юридическая проверка готовых<br/>учредительных документов  клиента',
          'Ликвидация организации без процедуры<br/>банкротства',
          'Внесение изменений в сведения<br/>об индивидуальном предпринимателе<br/>в ЕГРИП',
          'Подготовка заявлений в МРИ ФНС<br/>без подачи и получения<br/>листа записи (форма Р)'
        ],
        [
          'Подготовка простого договора (на<br/>базе стандартного имеющегося)',
          'Подготовка сложного договора (большая<br/>часть условий согласовывается с<br/>заказчиком)',
          'Подготовка учредительных документов и<br/>государственная регистрация акционерного<br/>общества',
          'Подготовка и внесение изменений<br/>в учредительные документы (увеличение/<br/>уменьшение уставного капитала, смена<br/>адреса, выход участника и<br/>распределение доли)',
          'Реорганизация общества',
          'Госрегистрация ИП',
          'Ликвидация предпринимательской<br/>деятельности без участия в ПФ и ФСС'
        ]
      ],
      estate: [
        [
          'Регистрация прав и сделок с<br/>недвижимостью в УФСРКК',
          'Оформление прав на земельные<br/>участки, оформление сервитута',
          '<span class="bold">Ведение наследственных дел</span>',
          '<span class="bold">Оформление трудовых отношений на<br/>предприятии</span> (подготовка полного пакета<br/>внутренних документов, необходимых для<br/>осуществления деятельности<br/>предприятия)'
        ],
        [
          'Заказ кадастровых паспортов, выписок<br/>из ЕГРП',
          'Приватизация жилых помещений',
          '<span class="bold">Сопровождение сделки у нотариуса</span>',
          '<span class="bold">Подготовка предприятия к проверке<br/>трудовой инспекцией</span> (анализ имеющихся<br/>документов, подготовка недостающих<br/>документов)'
        ]
      ],
      court: [
        [
          'Анализ судебного дела (изучение<br/>представленных материалов и дача<br/>заключения о возможном исходе дела)',
          'Представительство в суде общей<br/>юрисдикции',
          'Ведение исполнительного производства'
        ],
        [
          'Составление заявлений, жалоб, претензий,<br/>ходатайств',
          'Представительство в Арбитражном суде'
        ]
      ],
      accounting: [
        [
          'Консультация бухгалтера',
          'Восстановление бухгалтерского учета',
          'Формирование учетной политики<br/>организации',
          'Ведение кадрового учета',
          'Нулевая отчетность'
        ],
        [
          'Ведение учета',
          'Разблокировка расчетного счета',
          'Отчетность по МСФО',
          'Заполнение деклараций 3- НДФЛ',
          'Разовые бухгалтерские услуги'
        ]
      ]
    }
  }
}
</script>

<style lang="scss" scoped>
  .services {

    &__service {
      margin-bottom: 40px;
    }

    &__title {
      @include f-d-h1;
      color: $dark-blue;
      margin-bottom: 40px;
    }

    &__content {
      display: grid;
      grid-template-columns: repeat(2, 1fr);
      grid-column-gap: 15px;
    }
  }
</style>
